import { useSpring, animated } from '@react-spring/web'

const StartSpeach = () => {
    const springs = useSpring({
        from: { y: 250 },
        to: { y: 0 },
    })
    return (
        <animated.div className="textbox my-4" style={{...springs}}>
            <p>আমি বায়েজিদ আরেফিন। আমি এখানে আমার গল্প বলব। আমার বাবা একজন শিক্ষক। তাই আমি ব্যবসা করতে চাইলেও তা কঠিন। আমার লক্ষ্য হচ্ছে শিক্ষাব্যবস্থা নিয়ে কাজ করা। তাছাড়া একটি কোম্পানী বা কয়েকটি প্লাটফর্ম তৈরি করা। সেই প্লাটফর্মগুলো সেন্টার থেকে কন্ট্রল হবে। আমরা আমাদের লভ্যাংশ থেকে যাকাতের টাকা দিয়ে গরিবদের উপার্জনের ব্যাবস্থা করব। আমাদের প্রতিষ্টানের সকল কার্যকালাপ হবে কিস্তি বা সুদ মুক্ত। আমরা আমাদের সদস্যদের কোনো ভুলের জন্যে জরিমানার বিকল্পে অন্য শাস্তি ব্যাবস্থা করব। ব্যাংক বা কারো থেকে কোনো লোন নেওয়া হবে না। আমাদের প্রোজেক্ট পার্টনারশিপ বা একক মালিকানাধীন হবে।
            </p>

            <div className="project_box">
                <h3 className="project_title">Arefins Classroom</h3>
                <p className='mt-3'>এটি শিক্ষামূলক প্লাটফর্ম হবে। যেখানে আমার ক্লাস থাকবে। আমি প্রোগ্রামিং আর একাডেমিক ক্লাস নিব। ছাত্ররা সেখানে পরীক্ষা দিতে পারবে ফ্রিতে আবার অ্যাডভান্স পেইড পরীক্ষাও থাকবে। আমাদের প্রত্যেকটি অধ্যায়ের ফ্রি ক্লাস থাকবে আবার পেইড ক্লাসও থাকবে। বিজ্ঞাপন মুক্ত ক্লাস করানোর সর্বোচ্চ চেষ্টা করব। ৬ থেকে ১২ শ্রেণী পর্যন্ত বিজ্ঞান বিষয়ে আমর ক্লাস থাকবে। আইসিটি বিষয়ে ক্লাস থাকবে। আনুমানিক আমাদের প্রজেক্টের মোট ব্যায় ২ লক্ষ ৫০ হাজার টাকা হতে পারে ।</p>
                <dl className='mt-3'>
                <dt>June 2024</dt>
                <dd>ওয়েবসাইট পাবলিশ হবে। একটি ডোমেইন রেজিষ্ট্রেশন করতে হবে। আর প্রজেক্টে কাজ করার জন্যে ওয়েবসাইট তৈরি করতে হবে। আমাদের টিমের সদস্যরা প্রশ্ন সংযুক্ত করতে পারবে।</dd>
                <dt>July 2024</dt>
                <dd>পুরো প্রজেক্টের প্লান লিখিত আকারে উপস্থাপন করতে হবে। এই মাসের মধ্যে পূর্বের সহ 6500 টি প্রশ্ন সংযুক্ত করতে হবে। পূর্বের খরচ সহ মোট খরচ 7000 টাকার কম রাখার টার্গেট নিতে হবে। মেডিকেল ভর্তি পরীক্ষার জন্যে প্রিপারেশন বইয়ের Extra Info ভালোভাবে শেষ করতে হবে এবং কিছু গ্যাপ রাখা যাবে না।</dd>

                <dt>August 2024</dt>
                <dd>আমার মেডিকেল প্রিপারেশন নিতে হবে কঠোরভাবে এবং এর সাথে GK শুরু করতে হবে। এই মাসের মধ্যে পূর্বের সহ 10000 টি প্রশ্ন সংযুক্ত করতে হবে। পূর্বের খরচ সহ মোট খরচ 9500 টাকার কম রাখার টার্গেট নিতে হবে। যদি আমাদের আনুশীলনীর প্রশ্ন সংযুক্ত করা হয়ে যায় তাহলে আমরা ক্লাস ৯-১০ এর জন্যে SSC/Dakhil Board Question যুক্ত করব। যদি তা Possible না হই তাহলে আমরা ক্লাস ১১-১২ এর জন্যে University Admission প্রশ্ন যুক্ত করব।</dd>

                <dt>September 2024</dt>
                <dd>আমার মেডিকেল প্রিপারেশন নিতে হবে কঠোরভাবে GK আর English সম্পূর্ন করতে হবে। এই মাসের মধ্যে পূর্বের সহ 16000 টি প্রশ্ন সংযুক্ত করতে হবে। পূর্বের খরচ সহ মোট খরচ 15000 টাকার কম রাখার টার্গেট নিতে হবে। পূর্বের মাসের কাজ সম্পূর্ন হলে আমরা ক্লাস ১১-১২ এর জন্যে HSC/Alim Board Question যুক্ত করব।</dd>

                    <dt>October 2024</dt>
                    <dd>আমার মেডিকেল প্রিপারেশনে মডেলটেস্ট এ ভর্তি হতে হবে আর সব রিভিশন দিতে হবে। এই মাসের মধ্যে পূর্বের সহ 22000 টি প্রশ্ন সংযুক্ত করতে হবে। পূর্বের খরচ সহ মোট খরচ 21000 টাকার কম রাখার টার্গেট নিতে হবে। যদি আমাদের HSC/Alim Board Question সংযুক্ত করা হয়ে যায় তাহলে আমরা ক্লাস ১১-১২ এর জন্যে University Admission প্রশ্ন যুক্ত করব।</dd>

                    <dt>November 2024</dt>
                    <dd>মেডিকেল প্রিপারেশনে মডেলটেস্ট আর সব রিভিশন দিতে হবে এবং হতাশা দূর করতে হবে যা হবে আল্লাহ ভালোই করবে। আমি যে পরিশ্রম করেছি আল্লাহ ফল দিবেন ইনশাআল্লাহ। এই মাসের মধ্যে পূর্বের সহ 25000 টি প্রশ্ন সংযুক্ত করতে হবে। পূর্বের খরচ সহ মোট খরচ 23500 টাকার কম রাখার টার্গেট নিতে হবে। আমরা এই মাসে যেকোনো বিষয়ে প্রশ্ন সংযুক্ত করতে পারি।</dd>
                    <dt>December 2024</dt>
                    <dd>মেডিকেল জয় করতে হবে। এই মাসে TIN লাইসেন্স করতে হবে। তাছাড়া Trade লাইসেন্স করতে হবে। আমাদের একটি ব্যনিজ্যিক Office রুম বানাতে হবে। আমাদের ফাইনাল ওয়েবসাইটের ডিজাইন করতে হবে। ব্যনিজ্যিক ব্যাংক অ্যাকাউন্ট করতে হবে। একটি iPad with pen নিতে হবে। ডুয়েল কারেন্সি করতে হবে। তার জন্যে পাসপোর্ট করতে হবে। এসবের জন্যে মোট খরচ হবে 90,000 থেকে 1,05,000 টাকা। </dd>
                    <dt>January 2025</dt>
                    <dd>আমাদের ফাইনাল ওয়েবসাইট তৈরির কাজ শুরু করতে হবে। ভিডিও রেডি করতে হবে। ক্লাস ৯-১০ দিয়ে শুরু করতে হবে। ওয়েবসাইট তৈরি করা হবে MERN Stak এর উপরে ভিত্তি করে। ওয়েবসাইট তৈরির জন্যে বাজেট রাখতে হবে ৩০ হাজার টাকা। VPS Server কিনতে হবে। তার জন্যে প্রত্যেক মাসে 1500 টাকা করে দিতে হবে।</dd>
                    <dt>February 2025</dt>
                    <dd>ইন্টারমিডিয়েট লেভেলের জন্যে ক্লাস রেডি করতে হবে। বই কিনতে হবে আর একটা স্ক্যানার মেশিন কিনতে হবে। এসবের জন্যে 25,000 টাকা রাখতে হবে। তবে এটি অপশনাল।</dd>
                    <dt>March 2025</dt>
                    <dd>ওয়েবসাইট তৈরির কাজ শেষ করতে হবে। ফাইনাল ভাবে আমরা প্রডাকশন মুডে চলে যাব। আমাদের দরকার একজন ডিজিটাল মার্কেটার। আমরা ফেইসবুক ইউটিউব পেইজ খুলব। তারপরে Ads চালাবো। তারজন্যে ২০ হাজার টাকা বাজেট রাখতে হবে। আমরা সামান্য সামান্য করে Ads মার্কেটিং করব। আর ইউটিউব চ্যানেলে ভিডিও রান করব। চাইলে ওয়েবসাইট থেকেও ভিডিও ক্লাস করা যাবে আর পরিক্ষা দেওয়া যাবে।</dd>
                </dl>
            </div>
        </animated.div>
    );
};

export default StartSpeach;